IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G3_EPWM10_CONTROLSS_G3_EPWM10.xml
	<register id="CONTROLSS_G3_EPWM10_TZCBCCLR" acronym="CONTROLSS_G3_EPWM10_TZCBCCLR" offset="0x130" width="16" description="Trip Zone CBC Clear Register">
		<bitfield id="CAPEVT" width="1" begin="8" end="8" resetval="0x0" description="Clear Flag for CAPEVT selected for CBC   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CAPEVT] bit." range="8" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT2" width="1" begin="7" end="7" resetval="0x0" description="Clear Flag for Digital Compare Output B Event 2 selected for CBC   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[DCBEVT2] bit." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT2" width="1" begin="6" end="6" resetval="0x0" description="Clear Flag for Digital Compare Output A Event 2 selected for CBC   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[DCAEVT2] bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="CBC6" width="1" begin="5" end="5" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC6] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC6] bit." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="CBC5" width="1" begin="4" end="4" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC5] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC5] bit." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="CBC4" width="1" begin="3" end="3" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC4] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC4] bit." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="CBC3" width="1" begin="2" end="2" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC3] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC3] bit." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="CBC2" width="1" begin="1" end="1" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC2] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC2] bit." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="CBC1" width="1" begin="0" end="0" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC1] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC1] bit." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G3_EPWM10_TZOSTCLR" acronym="CONTROLSS_G3_EPWM10_TZOSTCLR" offset="0x132" width="16" description="Trip Zone OST Clear Register">
		<bitfield id="CAPEVT" width="1" begin="8" end="8" resetval="0x0" description="Clear Flag for CAPEVT selected for OST   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[CAPEVT] bit." range="8" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT1" width="1" begin="7" end="7" resetval="0x0" description="Clear Flag for Digital Compare Output B Event 1 selected for OST   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[DCBEVT1] bit." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT1" width="1" begin="6" end="6" resetval="0x0" description="Clear Flag for Digital Compare Output A Event 1 selected for OST   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[DCAEVT1] bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="OST6" width="1" begin="5" end="5" resetval="0x0" description="Clear Flag for Oneshot [OST6] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST6] bit." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="OST5" width="1" begin="4" end="4" resetval="0x0" description="Clear Flag for Oneshot [OST5] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST5] bit." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="OST4" width="1" begin="3" end="3" resetval="0x0" description="Clear Flag for Oneshot [OST4] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST4] bit." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="OST3" width="1" begin="2" end="2" resetval="0x0" description="Clear Flag for Oneshot [OST3] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST3] bit." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="OST2" width="1" begin="1" end="1" resetval="0x0" description="Clear Flag for Oneshot [OST2] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST2] bit." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="OST1" width="1" begin="0" end="0" resetval="0x0" description="Clear Flag for Oneshot [OST1] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZOSTFLG[OST1] bit." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G3_EPWM10_TZFRC" acronym="CONTROLSS_G3_EPWM10_TZFRC" offset="0x136" width="16" description="Trip Zone Force Register">
		<bitfield id="CAPEVT" width="1" begin="7" end="7" resetval="0x0" description="Force Flag for Capture Event Output   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the CAPEVT event trip condition and sets the TZFLG[CAPEVT] bit." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT2" width="1" begin="6" end="6" resetval="0x0" description="Force Flag for Digital Compare Output B Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCBEVT2 event trip condition and sets the TZFLG[DCBEVT2] bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT1" width="1" begin="5" end="5" resetval="0x0" description="Force Flag for Digital Compare Output B Event 1   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCBEVT1 event trip condition and sets the TZFLG[DCBEVT1] bit." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT2" width="1" begin="4" end="4" resetval="0x0" description="Force Flag for Digital Compare Output A Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCAEVT2 event trip condition and sets the TZFLG[DCAEVT2] bit." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT1" width="1" begin="3" end="3" resetval="0x0" description="Force Flag for Digital Compare Output A Event 1   0: Writing 0 has no effect. This bit always reads back 0  1: Writing 1 forces the DCAEVT1 event trip condition and sets the TZFLG[DCAEVT1] bit." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Force a One-Shot Trip Event via Software   0: Writing of 0 is ignored. Always reads back a 0.  1: Forces a one-shot trip event and sets the TZFLG[OST] bit." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Force a Cycle-by-Cycle Trip Event via Software   0: Writing of 0 is ignored. Always reads back a 0.  1: Forces a cycle-by-cycle trip event and sets the TZFLG[CBC] bit." range="1" rwaccess="R/W1TS"/>
	</register>
